<template>
  <div>
    <h2 class="info--text">Задачи</h2>
    <p>
      Все задачи проекта разбиты по статусам. <br>
      Круг определенного цвета в таблице сигнализирует о важности задачи:
      <b>зеленый</b> - низкая, <b>синий</b> - средняя, <b>красный</b> - высокая. <br>
      <b>Число в круге</b> означет процент выполненности задачи (от 0 до 100) <br>
      <b>План</b> - это примерное кол-во дней необходимое для завершения задачи
      ( считаются только рабочие дни - без учета выходных ). <br>
      <b>Сдача</b> - это дата желаемого завершения задачи ( указывает на приоритетность относительно других ).
    </p>
    <p>
      Создавать задачи может <b>только студия</b> на основе переговоров с заказчиком
      или как предложение дальнейшего развития проекта.
      <b>Только заказчик</b> может сменить статус задачи с "создана" на "ожидает выполнения". <br>
      Как только задача попадает в статус <b>"ожидает выполнения"</b>
      и Заказчик производит оплату не менее <b>50% от ее стоимости</b>, студия приступает к выполнению.
      После завершения задачи Заказчик обязан в течении двух дней принять и оплатить ее полную стоимость.
    </p>
    <p>
      Управлять статусом задачи можно нажав на -
      <v-icon size="medium">more_vert</v-icon>
      (справа в строке таблицы)
    </p>
    <p>
      Все изменнения происходящие с задачами: добавление новой, смена статуса, новые комментарии
      будут отображаться в меню сверху -
      <v-icon size="medium">notifications_none</v-icon>
    </p>
  </div>
</template>

<script>
  export default {
    name: 'TaskHelp'
  }
</script>

<style scoped>

</style>
