<template>
  <div>
    <h2 class="info--text">Задачи</h2>
    <p>
      Задачи проекта разбиты по статусам.
      Круг определенного цвета в таблице сигнализирует о важности задачи:
      <b>зеленый</b> - низкая, <b>синий</b> - средняя, <b>красный</b> - высокая.
    </p>
    <p>
      Создавать задачи может <b>только студия</b> на основе переговоров с заказчиком
      или как предложение дальнейшего развития проекта.
      <b>Только заказчик</b> может сменить статус задачи с "создана" на "ожидает выполнения".
      Как только задача попадает в статус "ожидает выполнения" - студия приступает к выполнению работы,
      а заказчик берет на себя обязательства указанные в документе "Договор на оказание услуг".
    </p>
    <p>
      Управлять статусом задачи можно нажав на -
      <v-icon size="medium">more_vert</v-icon>
      (справа в строке таблицы)
    </p>
    <p>
      Все изменнения происходящие с задачами: добавление новой, смена статуса, новые комментарии
      будут отображаться в меню сверху -
      <v-icon size="medium">notifications_none</v-icon>
    </p>
  </div>
</template>

<script>
  export default {
    name: 'TaskHelp',
  }
</script>

<style scoped>

</style>
