<template>
  <v-layout row justify-center>
    <v-dialog v-model="dialog" fullscreen hide-overlay transition="dialog-bottom-transition">
      <v-card>
        <v-toolbar dark color="primary">
          <v-btn icon dark @click.native="dialog = false">
            <v-icon>close</v-icon>
          </v-btn>
          <v-toolbar-title>Re:High Studio</v-toolbar-title>
          <v-spacer></v-spacer>
          <v-toolbar-items>
            <v-btn dark flat @click.native="dialog = false">Ok</v-btn>
          </v-toolbar-items>
        </v-toolbar>
        <v-container>
          <h3>Договор на оказание услуг</h3>
          <p>«____»___________ 2018 г.</p>

          <p>Азаров Алексей Витальевич, далее именуемый Исполнитель, и ________________________________________________________ далее именуемый Заказчик, с другой стороны, заключили настоящий договор о нижеследующем:</p>

          <h4>1. Предмет договора</h4>
          <p>1.1 Исполнитель по поручению Заказчика принимает на себя обязанности по разработке гипертекстового представления интернет-магазина  (в дальнейшем - сайт)  Заказчика, что является информационной услугой, а Заказчик обязан принять и оплатить данную работу.</p>

          <h4>2. Стоимость и порядок оплаты работ</h4>
          <p>2.1 Стоимость работ, поручаемых Исполнителю по настоящему Договору, определяется в соответствии с техническим заданием (в дальнейшем - ТЗ), подписанным Исполнителем и Заказчиком, которое является неотъемлемой частью настоящего договора (Приложение №1).</p>
          <p>2.2  Оплата работ по разработке сайта  осуществляется в три этапа:</p>
          <p>Оплата за первый этап 50% от общей стоимости работ, что составляет _ тысяч рублей до 01.04.2018 после сдачи первого этапа работ;</p>
          <p>Оплата за второй этап 50% от общей стоимости работ, что составляет _ тысяч рублей до 15.04.2018 после сдачи второго этапа работ;</p>

          <h4>3. Права и обязанности сторон</h4>
          3.1. Исполнитель обязуется:
          3.1.1. Оказывать услуги в соответствии с техническим заданием;
          3.1.2. Предоставлять Заказчику промежуточные результаты работы для контроля за соблюдением сроков и качества выполненных работ;
          3.1.3. Осуществить доработку сайта в случае вынесения замечаний в результате рассмотрения его Заказчиком, но в пределах технического задания (Приложение № 1);
          3.1.4. Передать выполненные работы Заказчику по окончании работ и полной оплате;
          3.1.5. Без дополнительной оплаты устранять ошибки в работе заявленного функционала в течении одного месяца после сдачи проекта. По прошествии одного месяца все ошибки в работе заявленного функционала и неточности в работе ведутся по согласованию сторон и за отдельную плату.
          3.2. Заказчик обязуется:
          3.2.1. Представить в течение трех дней с момента подписания договора основную для размещения на сайте текстовую и графическую информацию;
          3.2.2. Принимать к рассмотрению представленную Исполнителем работу по электронной почте или в сети Интернет, и в течение 2 рабочих дней информировать Исполнителя о принятом решении;
          3.2.3. Оплатить оказываемые ему услуги в порядке, который указан в п. 2 настоящего Договора.
          2.2.3. При выполнении работ раньше предусмотренного договором срока принять и оплатить их.
          3.3. Исполнитель имеет право сдать предусмотренные данным договором услуги досрочно.
          3.3. Исполнитель имеет право:
          приостановить исполнение заказанных работ в случае их несвоевременной оплаты Заказчиком.
          3.4. Заказчик имеет право:
          проверять ход и качество выполнения работ, не вмешиваясь в деятельность Исполнителя.

          4. Порядок выполнения и сдачи-приёмки работ
          4.1.1. Начало разработки сайта считается со дня утверждения дизайна Заказчиком.
          4.1.2. Программирование сайта выполняется строго с поставленным ТЗ (Приложение № 1)
          4.2. Рассмотрение стоимости и объема дополнительных правок осуществляется по согласованию сторон и оформляется дополнительным соглашением к ТЗ.
          4.2. По завершении работ по настоящему Договору Исполнитель уведомляет Заказчика о выполненной работе, которую Заказчик утверждает в течение двух дней с момента его получения и производит окончательную оплату работ в соответствии с п. 2.2. настоящего договора или дает мотивированный отказ приёма работ согласно расхождениям с ТЗ  (Приложение № 1).

          5. Ответственность сторон
          5.1. За неисполнение или ненадлежащее исполнение своих обязательств по настоящему Договору стороны несут ответственность в соответствии с действующим законодательством РФ.
          5.2. Все споры, возникающие между Сторонами при исполнении настоящего Договора, разрешаются путем переговоров, а в случае недостижения  согласия между Сторонами спор передается на рассмотрение суда, согласно подведомственности и подсудности, установленными законодательством РФ.

          6. Прочие условия
          6.1. Исполнитель сохраняет за собой авторские права на разработанный сайт и оставляет за собой право размещать ссылку с указанием координат Исполнителя.
          6.2. Право собственности на разработанный сайт переходит к Заказчику в  момент приемки выполненной работы и окончательной оплаты оказанных услуг.
          6.3. Настоящий договор составлен в двух подлинных экземплярах, которые имеют равную юридическую силу, по одному для каждой из сторон.
          6.4. Каждая из Сторон может в любое время отказаться от исполнения настоящего Договора,  предварительно уведомив другую Сторону не позднее,  чем за 3 (три) дня до даты расторжения. В этом случае Стороны производят все взаимные расчеты, в  том числе, за фактически выполненные к этому моменту услуги Исполнителем, в соответствии с ТЗ (Приложение № 1).

          7. Сроки действия договора
          7.1. Договор вступает в силу с момента его подписания Сторонами и получения предоплаты по данному договору.
          7.2. Договор прекращает свое действие с момента сдачи-приёмки выполненных работ по настоящему Договору и завершения всех взаиморасчетов между Сторонами.
          8. Реквизиты сторон

          Исполнители:
          Заказчик:

          Азаров Алексей Витальевич
          г. Новосибирск, ул Сиреневая 31, кв 65
          тел.: 8 999 467 78 57
          email: SmelayaPandaGM@gmail.com
          __________________/_______________/





          __________________/_______________/




        </v-container>
      </v-card>
    </v-dialog>
  </v-layout>
</template>

<script>
  export default {
    name: 'Dogovor',
    data () {
      return {
        dialog: true
      }
    },
    created () {
      this.$bus.$on('opeDogovorDialog', () => {
        this.dialog = true
      })
    }
  }
</script>

<style scoped>
</style>
