<template>
  <dialog-frame open-event="openImportantToKnowDialog">
    <div slot="title">Важно знать</div>
    <div slot="version">
      <v-select v-model="version" :items="items" label="version" prepend-icon="description"></v-select>
    </div>
    <div slot="description">
      <ol>
        <li>
          В разделе <b>стек-технологий</b> вы можете посмотреть то, что мы используем для разработки проектов.
          Хотя в нашем арсенале только современный инструменты, история знает примеры политических и иных мотивов
          блокировки, урезания и фундаментального изменения ресурсов любого уровня.
          Обращаем Ваше внимание - согласно договору студия не несет ответственности за изменения
          такого рода и не производит бесплатную доработку или переделывание своих продуктов в таких ситуациях.
          Изменения связанные с ценообразования используемых сервисов также не являются основанием
          для переработок или переноса сайта.
        </li>
        <li>
          <b>Будьте готовы к дополнительным расходам после создания сайта.</b>
          Как правило, все сайты требуют дополнительные финансовые вложения на поддержку:
          как на содержание серверов, баз данных или иных платных сервисов подключенных к проекту,
          так и на дополнительную доработку со стороны разработчика
          (внесение корректировок в функционал, устранение ошибок).
          Это нормальная практика во всем мировом ИТ сообществе, принимайте это как должное.
        </li>
        <li><b>Медиа-контент.</b>
          Для того чтобы не произошло непредвиденных блокировок функционирующего сайта,
          обращаем Ваше внимание на важность подбора лицензионного медиаконтента
          (в случае если он осуществляется с Вашей стороны).
        </li>
      </ol>
    </div>
  </dialog-frame>
</template>

<script>
  import DialogFrame from '../DialogFrame'

  export default {
    name: 'ImportantToKnow',
    components: {DialogFrame},
    data () {
      return {
        version: '1.0',
        items: ['1.0']
      }
    }
  }
</script>

<style scoped>
</style>
